{
      "intents": [
            {
                  "intent": "Greeting",
                  "text": {
                        "RU": [
                              "Привет",
                              "Приветствую",
                              "Здравствуйте",
                              "Как дела?",
                              "Здравствуй"
                        ],
                        "KG": [ "Саламатсызбы",
                              "Кандайсыз",
                              "Жакшысынарбы",
                              "Кутман тан",
                              "Кутман кеч",
                              "Кутман тун",
                              "Кутман кун"
                        ]
                  },
                  "responses": {
                        "RU": [
                              "Доброго времени суток, чем могу быть полезен для Вас?"
                        ],
                        "KG": [
                              "Саламатсызбы кандай суроонузга жооп бере алам?"
                        ]
                  },

                  "extension":  {
                        "function": "",
                        "entities": false,
                        "responses": []
                  },
                  "context":  {
                        "in": "",
                        "out": "GreetingUserRequest",
                        "clear": false
                  },
                  "entityType": "NA",
                  "entities": []
            },
            {
                  "intent": "CallingpProblem1",
                  "text": {
                        "RU": [
                        "У меня проблема с звонками. Не могу позвонить ни на один номер.",
                        "Не совершаются исходящие звонки на все номера",
                        "Не совершаются исходящие",
                        "Не могу дозвониться до другого человека"
                        ],
                        "KG": ["Чалуулар иштебей жатат",
                        "Чалалбай жатам бут номерлерге",
                        "Мен чалсам кетпей жатат"
                        ]
                  },
                  "responses": {
                        "RU":[
                        "Пожалуйста, проверьте следующее: \n1.Убедитесь, что у вас достаточно средств на балансе для совершения звонка.\n2. Попробуйте перезагрузить телефон и попробовать снова.\n3. Уточните, появляется ли какое-либо сообщение об ошибке при попытке звонка.\n"
                        ],
                        "KG": [
                              "Биринчиден балансыңызда акча каражат бар болгонун билип алыныз. Экинчиден телефонду очуруп кайра жандырып коруңуз. Эгерде жардам бербесе чалып жатканда телефонуңуздагы экранда эмне деп жазылып турат айта кетиңиз"
                        ]
                  },
                  "extension":  {
                        "function": "",
                        "entities": false,
                        "responses": []
                  },
                  "context":  {
                        "in": "",
                        "out": "",
                        "clear": true
                  },
                  "entityType": "NA",
                  "entities": []
            },
            {
                  "intent": "CallingProblem2",
                  "text": {
                        "RU":[
                        "У меня проблема с звонками. На экране телефона появляется сообщение 'Нет доступа к сети'.",
                        "Когда звоню пишет 'Нет доступа к сети'",
                        "Не доступа к сети"
                  ],
                        "KG": ["Чалайын десем нет доступа к сети деп жатат",
                        "Чалсам 'нет доступа к сети' деп атат"]
                  },
                  "responses": {
                        "RU":[
                        "Это может быть связано с:\n1. Плохим качеством сигнала. Попробуйте поменять местоположение и попробовать снова.\n2. Отключенными мобильных данными. Убедитесь, что у вас включены мобильные данные на телефоне.\n3. Проблемами с вашей SIM-картой. Попробуйте перезагрузить телефон или проверить, что SIM-карта правильно вставлена."
                  ],
                        "KG": ["Бул кырдаал сигналдын сапаты начар болгондуктан болушу мүмкүн. Ордунарды озгортуп кайра чалып корунуз жана мен телфондун настройкалырн карап корунуз. Тескөөлорун интернеттен табы аланыз"]
                  },
                  "extension":  {
                        "function": "",
                        "entities": false,
                        "responses": []
                  },
                  "context":  {
                        "in": "",
                        "out": "CourtesyGreetingUserRequest",
                        "clear": true
                  },
                  "entityType": "NA",
                  "entities": []
            },
            {
                  "intent": "CallingProblem3",
                  "text": {
                        "RU":[
                        "У меня проблема с звонками. Я использую телефон с двумя SIM-картами",
                        "Не могу совершить звонок, в телефоне 2 симкарты, сим-карты, сим карты",
                        "2 симкарты в телефоне, не могу позвонить",
                        "2 симкарты в телефоне"
                  ],
                         "KG":[
                             "Чалуулар менен кыйынчылыктар болуп жатат, телефондо 2 симкарта бар",
                               "Чалсам кетпей жатат, телефондо 2 симкарта бар"
                         ]
                  },
                  "responses": {
                        "RU":[
                        "Пожалуйста, выполните следующие шаги:\n1. Убедитесь, что вы выбрали правильную SIM-карту для совершения звонка.\n2. Если вы уверены в правильности выбора, попробуйте перезагрузить телефон и попытаться снова.\n3. Если проблема остается, свяжитесь с оператором"
                  ],
                        "KG": [
                              "Сураныч, төмөнкү кадамдарды аткарыңыз:\n1. Чалуу үчүн туура SIM картаны тандаганыңызды текшериңиз.\n2. Эгер сиз туура тандоого ишенсеңиз, телефонуңузду өчүрүп күйгүзүп, кайра аракет кылыңыз.\n3. Эгер көйгөй чечилбесе, операторго кайрылыңыз"
                        ]
                  },
                  "extension":  {
                        "function": "",
                        "entities": false,
                        "responses": []
                  },
                  "context":  {
                        "in": "",
                        "out": "",
                        "clear": true
                  },
                  "entityType": "NA",
                  "entities": []
            },
            {
                  "intent": "CallingProblem4",
                  "text": {
                        "RU": [
                        "У меня проблема с качеством связи и обрывами соединения. Я сталкиваюсь с затруднениями при звонке на все номера.",
                        "качество связи хромает при звонках на все номера",
                        "Плохое качество связи когда звоню на все номера"
                  ],
                        "KG": [
                              "Менде чалуулардын сапаты жана өчүрүүлөр менен көйгөй болуп жатат. Бардык номерлерге чалуу кыйын болуп жатат.",                              "Бардык номерлерге чалганда байланыштын сапаты аксап жатат",
                              "Бардык номерлерге чалганда чалуунун сапаты начар"
                        ]
                  },
                  "responses": {
                        "RU":[
                              "Пожалуйста, свяжитесь с оператором для решения Вашего вопроса"
                        ],
                        "KG": [
                              "Маселени чечүү үчүн оператор менен байланышыңыз"
                        ]
                  },
                  "extension":  {
                        "function": "",
                        "entities": false,
                        "responses": []
                  },
                  "context":  {
                        "in": "",
                        "out": "",
                        "clear": false
                  },
                  "entityType": "NA",
                  "entities": []
            },
            {
                  "intent": "CallingProblem5",
                  "text": {
                        "RU":[
                              "У меня проблема с качеством связи и обрывами соединения. Затруднения есть только на одном номере. ",
                              "Только у меня плохое качество связи",
                              "Обрывы при звонках, только на моем номере",
                              "Плохая связь у меня"
                        ],
                        "KG": [
                              "Менде байланыштын сапаты жана байланыш үзгүлтүктөрү менен көйгөй бар. Бир гана номерде кыйынчылыктар бар. ",
                              "Менде гана байланыш сапаты начар",
                              "Чалканда жабык, менин номеримде гана",
                              "Менин байланышым начар"
                        ]
                  },
                  "responses": {
                        "RU":[
                              "Пожалуйста, проверьте качество связи изменив свое местоположение. Если после смен местопложения, качество связи все еще плохое, то рекомендуем вам обратить в ближайший офис O!Store для проверки вашей сим-карты. Адреса офисов можно посмотреть перейдя по следующей ссылке https://clck.ru/34sDoC"
                        ],
                        "KG": [
                              "Жайгашкан жериңизди өзгөртүү менен байланыштын сапатын текшериңиз. Эгерде жайгашкан жерди өзгөрткөндөн кийин, байланыш сапаты дагы эле начар болсо, SIM картаңызды текшерүү үчүн жакынкы O!Store кеңсесине кайрылууну сунуштайбыз. Офис даректерин төмөнкү шилтемени чыкылдатуу менен көрүүгө болот https://clck.ru/34sDoC"
                        ]
                  },
                  "extension":  {
                        "function": "",
                        "entities": false,
                        "responses": []
                  },
                  "context":  {
                        "in": "",
                        "out": "",
                        "clear": false
                  },
                  "entityType": "NA",
                  "entities": []
            },
            {
                  "intent": "CallingProblem6",
                  "text": {
                        "RU":[
                              "До меня не могут дозвониться",
                              "Не поступают входящие звонки",
                              "что делать если до меня не могут дозвониться?",
                              "Проблема с входящими звонками"
                        ],
                        "KG": [
                              "мага чала албай жатат",
                              "Кирүүчү чалуулар жок",
                              "Эгер алар мага жете алышпаса, мен эмне кылышым керек?",
                              "Кирүүчү чалуулар менен көйгөй"
                        ]
                  },

                  "responses": {
                        "RU":[
                              "Если вам не могут дозвониться только с одного номера, то возможно, есть проблемы с этим конкретным номером. \n Проверьте не подключена ли у вас услуга 'переадресация', или 'запрет на входящие вызовы'. Если эти услуги подключены, вы можете отключить их путем набора команды '*000#'.\nЕсли эти услуги у вас не подключены то рекомендуем вам обратиться к оператору."
                        ],
                        "KG": [
                              "Эгер сиз бир гана номерден байланыша албасаңыз, анда ал номерде көйгөй болушу мүмкүн. \n Сизде 'переадресация' же 'запрет на входящие вызовы' иштетилгендигин текшериңиз. Бул кызматтар иштетилген болсо, анда '*000#' буйругун терүү менен аларды өчүрүңүз.\nЭгер сизде бул кызматтар туташкан жок болсо, операторуңузга кайрылууну сунуштайбыз."
                        ]
                  },
                  "extension":  {
                        "function": "",
                        "entities": false,
                        "responses": []
                  },
                  "context":  {
                        "in": "",
                        "out": "",
                        "clear": false
                  },
                  "entityType": "NA",
                  "entities": []
            },
            {
                  "intent": "InternetProblem1",
                  "text": {
                        "RU":[
                              "Не работает интернет в телефоне",
                              "Интернет не пашет",
                              "Что с вашим интернетом, он не работает?"
                        ],
                        "KG": [
                              "Телефондо интернет иштебейт",
                              "Интернет иштебей жатат",
                              "Интернетиңизде эмне болду, иштебей жатабы?"
                        ]
                  },
                  "responses": {
                        "RU":[
                              "Если вы выполняли настройки в телефоне (включая прошивку телефона, изменениени внктренних настроек в телефоне, перестановка сим-карты на другой телефон), то вам необходимо выполнить ручные настройки для телефона. Для этого необходимо зайти Натройки->Мобильные сети->Выьерите сим-карту->Точки доступа APN->Новая точка доступа->В поле 'Имя' заполнить:'O!',в поле APN заполнить:'internet', в поле тип APN заполнить 'default'\n Если вы не выполняли никаких настроек в телефоне то рекомендуем вам обратиться к оператору "
                        ],
                        "KG": [
                              "Эгер сиз телефондо жөндөөлөрдү аткарган болсоңуз (анын ичинде телефонду жаркыруу, телефондун ички жөндөөлөрүн өзгөртүү, SIM картаны башка телефонго жылдыруу), анда сиз телефонго кол менен жөндөөлөрдү жасашыңыз керек. Бул үчүн Орнотууларга өтүңүз. -> Мобилдик тармактар-> SIM картасын тандаңыз->APN кирүү чекиттери->Жаңы кирүү чекити->'Аты' талаасында: 'O!', APN талаасында: 'Интернет', APN түрүн толтуруңуз талааны толтуруу 'демейки'\n Эгерде сиз телефондо эч кандай орнотууларды жасабасаңыз, оператор менен байланышууну сунуштайбыз "
                        ]
                  },
                  "extension":  {
                        "function": "",
                        "entities": false,
                        "responses": [ ]
                  },
                  "context":  {
                        "in": "",
                        "out": "",
                        "clear": false
                  },
                  "entityType": "NA",
                  "entities": []
            },
            {
                  "intent": "InternetProblemSpeed1",
                  "text": {
                        "RU":[
                              "У меня низкая скорость интернета",
                              "Интернет долго загружается",
                              "Плохой интернет",
                              "Что происходит со скоростью интернета?"
                        ],
                        "KG": [
                              "Менин интернет ылдамдыгым жай",
                              "Интернетти жүктөө көп убакытты талап кылат",
                              "Начар Интернет",
                              "Интернет ылдамдыгы эмне болуп жатат?"
                        ]
                  },
                  "responses": {
                        "RU":[
                              "Если у вас затруднения с интернетом только внутри определенного здания или помещения, то возможно радиоволны плохо распространяются в помещении, в котором вы находитесь. Рекомнедуем поменять местоположение пользования интернетом.\n Если у вас низкая скорость интерента за пределами помещений и затруднения у всех рядом находящихся абонентов в вашем районе, то рекомендуем вам обратиться к опреатору.\nЕсли затруднения только у вас и полный уровень сигнала 4G,  то рекомендуем вам обратиться к опретатору.\nЕсли у вас уровень сигнала 4g неполный, то рекомендуем вам поменять местоположение пользования интернетом. \nЕсли у вас выбрана сеть 3G, то рекомендуем вам переключить режим сети на 4G. Благодаря технологии 4G (LTE) можно мгновенно загружать фильмы и музыку, обмениваться большим количеством фотографий, проводить видеоконференции с высоким качеством картинки и отсутствием подтормаживаний"
                        ],
                        "KG": [
                              "Эгерде сиз кайсы бир имараттын же бөлмөнүн ичинде гана интернет менен кыйынчылыкка туш болуп жатсаңыз, анда радио толкундар сиз турган бөлмөдө жакшы таралбашы мүмкүн. Интернетти колдонгон жериңизди өзгөртүүнү сунуштайбыз.\n Эгер сизде интернет аз болсо. Сиздин аймактагы жакын жердеги абоненттердин баары үчүн көйгөй болсо, операторго кайрылууну сунуштайбыз.\nЭгер сизден жалгыз кыйынчылык болуп жатса жана 4G сигналынын деңгээли толуп калса, операторго кайрылууну сунуштайбыз.\nЭгер 4g сигналыңыз болсо күчү толук эмес, интернетти колдонуунун жайгашкан жерин өзгөртүүнү сунуштайбыз.\nЭгер сизде 3G тармагы болсо, тармак режимин 4Gге которууну сунуштайбыз, 4G (LTE) технологиясынын аркасында, сиз заматта тасмаларды жана музыка, көп сандагы сүрөттөрдү бөлүшүү, жогорку сүрөт сапаты жана кекечтенбей видео конференцияларды өткөрүү"
                        ]
                  },
                  "extension":  {
                        "function": "",
                        "entities": false,
                        "responses": []
                  },
                  "context":  {
                        "in": "",
                        "out": "",
                        "clear": false
                  },
                  "entityType": "NA",
                  "entities": []
            },
            {
                  "intent": "Bye",
                  "text": {
                        "RU":[
                              "Спасибо, до свидания",
                              "Прощайте",
                              "Спасибо за помощь",
                              "Благодарю"
                        ],
                        "KG": [
                              "Сага рахмат",
                              "Жакшы калыңыз",
                              "Жардамы үчүн рахмат",
                              "Рахмат"
                        ]
                  },
                  "responses": {
                        "RU":[
                              "Спасибо за обращение, всего доброго"
                        ],
                        "KG": [
                              "Кайрылганыңыз үчүн рахмат, салматта болуңуз!"
                        ]
                  },
                  "extension":  {
                        "function": "",
                        "entities": false,
                        "responses": []
                  },
                  "context":  {
                        "in": "",
                        "out": "",
                        "clear": false
                  },
                  "entityType": "NA",
                  "entities": []
            }
      ]
}